{"posts":[{"title":"Intro to Covering Spaces","text":"","link":"/2024/06/13/Intro-to-Covering-Spaces/"},{"title":"Intro to Fundamental Groups","text":"","link":"/2024/06/13/Intro-to-Fundamental-Groups/"},{"title":"Introduction to Modules","text":"In this post we introduce an algebraic structure called Modules. Informally, these are just vector spaces over a ring (instead of a field)! If you are looking for a quick intro to the things about Modules that everyone should know, hop right in… Definitions and ExamplesLet $R$ be a ring (not necessarily commutative nor with $1$). Then a set $M$ is called a left $R$-module if $M$ is an abelian group along with a map $R\\times M\\to M$, denoted $(r,m)\\mapsto rm$, satisfying the following properties for all $r,s\\in R$ and all $m,n\\in M$ : (M1) $(r+s)m = rm + sm$ ; (M2) $r(m+n) = rm + rn$ ; (M3) $(rs)m = r(sm)$ ; (M4) If $1\\in R$, then $1m=m$ ; Modules satisfying condition (M4) are called unital. A right $R$-module is defined analogously (using a map $M\\times R\\to M$ and so on). Some Important Remarks: Note that since $M$ is required to be an abelian group, we can naturally add/subtract in an $R$-module $M$. Also, the existence of the map $R\\times M\\to M$ satisfying the above conditions enforces a \"well-behaved scalar multiplication\" on $M$ (the scalars coming from $R$). This why Modules are said to be a direct generalization of vector spaces over a field. When $R$ is commutative, any left $R$-module is naturally also a right $R$-module (with the definition $rm = mr$). When $R$ is a field, a left (or right) $R$-module is nothing more than a Vector Space! (Optional) Notice that any left (or right) $R$-module $M$ always satisfies the definition of a left (or right) group action of $R^\\times$ on the set $M$, where $R^\\times$ is the (multiplicative) group of units in the ring $R$. Some ExamplesConsider $R$ any ring. Then $R$ is always trivially a left (and right) $R$-module.","link":"/2024/06/11/Introduction-to-Modules/"}],"tags":[{"name":"Algebraic-Topology","slug":"Algebraic-Topology","link":"/tags/Algebraic-Topology/"},{"name":"Covering Spaces","slug":"Covering-Spaces","link":"/tags/Covering-Spaces/"},{"name":"Groups","slug":"Groups","link":"/tags/Groups/"},{"name":"Modules","slug":"Modules","link":"/tags/Modules/"},{"name":"Rings","slug":"Rings","link":"/tags/Rings/"}],"categories":[{"name":"Mathematics","slug":"Mathematics","link":"/categories/Mathematics/"},{"name":"Topology","slug":"Mathematics/Topology","link":"/categories/Mathematics/Topology/"},{"name":"Abstract Algebra","slug":"Mathematics/Abstract-Algebra","link":"/categories/Mathematics/Abstract-Algebra/"}],"pages":[{"title":"About Me","text":"This BlogThis blog is (in general) for educational purposes in mathematics and/or mathematical/theoretical physics for writing down what I have done/learnt. My motivation in starting this blog was to help others understand important (and beautiful) topics in graduate-level Mathematics and Theoretical Physics, and to also improve my own understanding of these topics. If you want to make a reference to my posts (to use it for “educational” purposes), the only price is to give me credit. All the contents of this blog are licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License. My GoalsAs of June $2024$, my goal is to reach 50 posts by the end of this year! This may be a lot considering all the other things I’m doing this Summer and Fall. A more doable goal of mine is to create at least $25$ posts that are of the form “Intro to $X$” and will be slighly longer in length than usual. These “Intro to $X$” posts would usually contain concepts realted to $X$ that everyone who wants to work on $X$ ‘must know’. I will always provide (at least) a general reference to a more careful/elaborate introduction and also a more advanced reference for ‘next steps’. When I reach a goal, I will update this section to include newer goals! Contact and Misc.You can contact me at Phyhouse$31416$ ! Gmail.Com (relabel $!\\leftrightarrow @$, nothing capitalized). This is the second quickest way to reach me, the quickest being the DisQus comments section at the end of each post. Finally, if you find anything mathematically/physically wrong in my posts, or any dead links, please let me know!","link":"/About-Me/index.html"}]}